package com.pinting.business.enums;

import java.util.ArrayList;
import java.util.EnumSet;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public enum SmsErrorCodeEnum {

	M_00043("M:00043", "30秒内相同号码重复提交相同内容被拦截"),
	M2_0043("M2:0043", "30秒内相同号码重复提交相同内容被拦截"),
	DB_0140("DB:0140", "用户没有上传白名单到移动审核，因为客户需要把要发送的号码上传到一个网站，然后PTO处理（即移动那边也要审核号码）。所以没审核是发不了的"),
	NP_1243("NP:1243", "携号转网，转后一般收不到通道类的信息"),
	NP_1241("M:M2:0043", "携号转网，转后一般收不到通道类的信息"),
	_1033("-1033", "内容有关键字"),
	_33("33", "通道堵塞"),
	DB_0141("M:M2:0043", "用户没上行4个1定制梦网信息,用户之前有屏蔽这类型的信息.用户发送1111到这个通道号就可以了"),
	_51("51", "联通加黑名单，必须叫客户不要再投诉。然后叫王工联系运营商解除黑名单"),
	M_BLACK("M:BLACK", "此手机号码在平台加了黑名单，所以接收不到"),
	M_00009("M:00009", "端口绑定错了。端口可能没启用，联系下网关看看，重新绑定一下。然后叫客户测试一下。或者是老平台绑定SI通道的子端口，已转到SI平台的账号上面去"),
	IB_0064("IB:0064", "西藏号码给当地运营商屏蔽，导致接收失败。"),
	M_00044 ("M:00044", "客户提交的内容是空的,叫用户查下是不是接口原因或提交有问题。"),
	DB_0107("DB:0107", "业务不存在，估计是通道停了，可以让平台测试下这个通道能不能接收到信息。"),
	M_00308("M:00308", "308端口错误，联系网关看是不是通道停用了，或是端口切换了没有报备。"),
	DB_0108("DB:0108", "该业务暂停服务，可能是该通道停了。"),
	IB_0008("IB:0008", "号码归属地当地网关限速（贵码）。上海地区当地网关接收速度慢，叫客户小批量间开提交 。一般小于5000个号码左右批量提交。（贵码）"),
	M_02020("M:02020", "客户的扩展端口太长，叫工程部处理下。或叫网关改下。"),
	MK_0004("MK:0004", "发送抵制国家法规的信息，通道被公安部门封停。"),
	R_00255("R:00255", "停机或联通通道接收不到也会出现此代码"),
	IA_0057("IA:0057", "上海地区流量限制（广码）"),
	IA_0006("IA:0006", "地区流量限制（天码）"),
	R_00013("R:00013", "手机停机"),
	R_00086("R:00086 ", "号码联通内部加黑名单，让用户上行5个1解除或拨打运营商电话解除。"),
	R_00012("R:00012", "停机"),
	M_00011("M:00011", "通道没有生效，找网关解决下。或是端口没有绑定对。"),
	R_00061("R:00061", "客户同一号码在几秒钟发送速度过快，即发送多条信息，容易导致失败。(超流速)"),
	DB_0182("DB:0182", "移动黑名单，可以让客户打当地运营商咨询，取消屏蔽这个通道信息，免除黑名单。或者是切换其他通道，切换后有可能接收到。因为每个通道端口号不一样的"),
	MK_0001("MK:0001", "手机停机、空号等。可以找号码拨打一下。"),
	R_00008("R:00008", "一般是停机、没服务、关机这几个原因"),
	DB_0101("DB:0101", "运营商网关有问题"),
	MK_0005("MK:0005", "停机，可以拨打下试试。"),
	MB_0010("MB:0010", "四川地区特别时期有拦截"),
	M_00208("M:00208", "账号无余额"),
	M_01002("M:01002", "通讯失败，网关连接失败"),
	M_00010("M:00010", "通道号错误,报错的时候多数是没有绑定电信通道。从而使电信号码走到其他移动或联通的通道，导致报错。客户其他移动号码接收成功，但有些移动号码报这个错误，因为这个通道只能发湖北移动的号码，其他地区的号码是发送不了的。会拦截报M:00010错误。"),
	R_00011("R:00011", "停机"),
	R_00059("R:00059", "关机"),
	DB_0142("DB:0142", "超过通道日发送量，联系PTO同事解除。当地网关有限速"),
	IB_0148("IB:0148", "河南或湖南地区屏蔽"),
	MK_0013("MK:0013", "停机"),
	MK_0012("MK:0012", "停机"),
	MK_0115("MK:0115", "河南地区关键字或垃圾短信拦截"),
	M2_0010("M2:0010", "长短信内容+签名不能超过124个字，否则会报这个错误。"),
	M_01000("M:01000", "通道停了。连接网关失败,当时段应该是湖北联通运营那边网关有问题，导致连接不上"),
	R_00601("R:00601", "手机空号。601报错。是手机没有开通短信功能"),
	R_00056("R:00056", "有关键字,可以叫PTO找网关查下，看能不能取消。手机SIM卡网络没更新或是这号码接收的短信过多引起的。手机终端响应超时。建议用户清理下收件箱和缓存，重启手机再测试。"),
	M_01020("M:01020", "通道端口超过长度"),
	_615("615", "SMDPP响应:失败码=35(终端问题-目标资源短缺),终端问题,一是手机二是手机卡。应该是发送信息给用户时，用户终端未响应或不稳定导致。"),
	_1("1", "关机或未知用户"),
	_8("8", "空号"),
	_13("13", "停机的或呼叫受限"),
	_12("12", "空号、号码多数是无效的"),
	M_00145("M:00145", "超流量。速度过快。有些MAS机返回的。"),
	_64("64", "端口超长"),
	M_00042("M:00042", "内容有关键字"),
	M2_0042("M2:0042", "平台审核拦截掉返回"),
	MK_0000("MK:0000", "内容有投诉，广西地区屏蔽此账号的端口。导致大面积失败。空号，拨打几个号码试试。"),
	REJECTD("REJECTD", "湖北MAS通道白名单拦截，用户未报备。福建移动限速"),
	_1055("1055", "错误代码表示内容有关键字。账号是TQ0003或TQ0001等此种类型：QC客户端的账号，发送走的是0532通道。查询记录可以在QC平台查询。"),
	M_00100("M:00100", "通道余额不足"),
	MM_0000 ("MM:0000 ", "广西地区屏蔽了此账号的端口，导致大面积失败。联系PTO解除。客户一次性提交的短信条数超出了浙江网关的最大提交数"),
	R_00113("R:00113", "信息内容整条被拦截，美容、整形类的不能发。或由于十八大影响， 通道签名内容方面要求更加严格。签名格式为：【****】不可为[****]，此类也会拦截。"),
	E2_0208("E2:0208", "余额不足"),
	M_00169("M:00169", "天码黑名单，可能之前有投诉，可以找下陈敏查下。"),
	R_00999("R:00999", "河北电信限速。同一号码短时间内下发量太大或频繁，被被叫用户所在省的监控系统屏蔽。（类似于平台的30秒内重复发送被拦截）。上海地区瞬间流控问题，做一下补发机制就好 。可能同一账号瞬间重复给此号码发送信息导致被拦截。"),
	R_00660("R:00660", "一般都是手机号码接收信息有问题，即手机终端问题。地区屏蔽，建议客户不要大量发送陕西地区，660的问题现基本都是地区屏蔽，今后再有碰到660的问题，让客户控制发送量。"),
	R_00662("R:00662", "一般都是手机号码接收信息有问题，即手机终端问题。"),
	M_00016("M:00016", "通道加端口号码导致报错。可以让平台查下是不是所有通道加端口的都报错了，然后叫网关把账号走这个通道的端口号码去掉，让客户重新登录再测试。"),
	Msg_src("Msg_src", "通道没绑好"),
	MK_0660("MK:0660", "四川地区有屏蔽此通道的信息，切换广商测试可以接收。"),
	M_00101("M:00101", "通道停了。桂林联通超流量（此代码可能是间歇出现）。查看整个通道是不是有大量出现此代码，如有建议切换到其他联通通道。"),
	NOROUTE("NOROUTE", "查找路由失败，客户发送157的号码段返回此代码，后经查询157号段是座机号码，从而导致接收失败。"),
	_1015("-1015", "现在AD类长短信要分开来发送，否则可能会导致我们这边发送失败。显示“-1015”错误代码。"),
	ID_0076("ID:0076", "平台测试可以接收，客户QC账号测试返回“ID:0076”，可以联系网关更改客户QC账号的扩展子号，再测试。内容有关键字。一般是接口账号报这个错误，原因是接口类型的检测不出来。可以把客户的内容在QC平台发送检测下。关键字中间加 .即可。"),
	R2_0011("R2:0011", "端口可能没绑好，测试下其他手机，如果还是失败，更换端口再测试。"),
	MK_0036("MK:0036", "青海地区屏蔽此通道的信息，可以让其他通道测试当地手机能否收到，如收到则分流。"),
	R_00444 ("R:00444 ", "运营网关那面的网元之间传递造成的，流量控制错误，网元之间传递超速。即运营商网关与网关之间递交超速。"),
	R_0001("R:0001", "内容非法或有关键字"),
	DB_0106("DB:0106", "服务代码错误。华瑞J00070出现过，客户侧去掉扩展端口，即客户侧不要扩展端口测试下。"),
	R1_0002("R1:0002", "内容有问题"),
	E2_0013("E2:0013", "手机号码错误"),
	R1_0001("R1:0001", "内容非法”，内容不能发。或内容有广告性质不能发。发送失败，运营网关连接不太稳定。我们有时会提交不过去，导致发送失败。"),
	R_00055("R:00055", "红树电信黑名单 解除后可以正常接收"),
	R_00108("R:00108", "端口可能没启用或用户账号此通道没报备。切换至其他电信通道。"),
	R_00064("R:00064", "超流速失败，重庆联通号码，通道瞬间大批量提交，当地网关缓存不足失败。扩展号过长，主通道+扩展端口超过20位"),
	R_00017("R:00017", "超流速失败，重庆联通号码，通道瞬间大批量提交，当地网关缓存不足失败。"),
	R_00067("R:00067", "黑名单"),
	R_00005("R:00005", "暂停服务"),
	R1_1007("R1:1007", "此通道不支持长短信拆分。改为一条内容即可。"),
	M2_0006("M2:0006", "QC客户端提交出现此代码，且内容长度合法，可以让网关更改账号10690361扩展子号，再测试下。"),
	MB_0088("MB:0088", "查看是否有同一号码大部分重复提交。为移动短信中心内部错误，注意提交频率。同一号码不要频繁短时间内提交"),
	E1_0009("E1:0009", "E开头是EMP平台返回的代码，提交失败。EMP中账号的通道号没绑对。"),
	R1_0003("R1:0003", "通道暂停或内容有问题，一般内容可能含有特殊符号或网址。"),
	R_00041("R:00041", "原因当时通道运营商用更改后的企业代码发送时，发送黑龙江就失败。用回原来的就正常，后来已切换回原来的企业代码了。企业代码：指移动平台联调的一个参数。"),
	R_00072("R:00072", "福建联通返回。通道加端口号超长。最多只能19位"),
	MB_1041("MB:1041", "超流速。天津移动号码返回，客户大批量同一时间提交，超过当地短信网关允许的最大值导致失败。(目前重庆短信中心针对10657120端口所能开设的最大值为1W条/S);建议客户减少一次性群发提交量，避免大批量集中发送，分批提交。重庆地区，原因分别是用户关机、核心网临时超负荷返回57-msc系统错误（一般是MSC的TCAP层负荷过大，经流控后回的消息）和用户不在服务区，请做好客户解释。"),
	MM_0064("MM:0064", "运营商关键字拦截"),
	R_00090("R:00090", "手机终端故障 短信存储满"),
	R1_0127("R1:0127", "此通道欠费返回"),
	R_00073("R:00073", "空号"),
	R1_0005("R1:0005", "通道欠费"),
	R_00006("R:00006", "空号"),
	R_00222("R:00222", "内容不能发或有关键字"),
	R_00015("R:00015", "总部网关返回，手机用户关机。内容不能发或有关键字"),
	R_00000("R:00000", "暂停服务，大批量出现查看是否同一区域，有可能是区域屏蔽。一些低端智能手机，下发长短信的时候，前面收到了，后面内存响应处理不了，没有回执网关就认为下发失败。"),
	R_00018("R:00018", "查看是否有同一号码大部分重复提交。客户今天内容末尾没加“回复TD退订”发送失败。另也有可能是通道停用返回。同一号码频繁发送监控信息，10690333对手机当天的上限条数没有限制的，手机处理不过来这么多信息，短信下发太频繁终端手机会响应不过来。建议减小发送频率。"),
	R1_2041("R1:2041", "内容含有非法关键字"),
	R_00070("R:00070", "让平台确认是否为联通黑名单用户。联通网关技术确认，为福建联通黑名单，用户打10010解除。"),
	R1_1011("R1:1011", "黑名单用户"),
	R1_0044("R1:0044", "原因：这个通道凌晨到7点不发信息"),
	R_06608("R:06608", "彩信通道已停用"),
	MK_0118("MK:0118", "河南地区关键字或垃圾短信拦截"),
	MB_0255("MB:0255", "陕西地区，被叫号码群中存在大量的非正常用户（用户关机、不在服务区、停机等），短信在下发给此类用户的过程中会在短信中心存储等待调度重发，导致将短信中心为此代码分配的缓存占满。"),
	R1_0020("R1:0020", "31号珠海联通凌晨升级，导致信息递交不过去失败掉，我们平台返回这个代码。即信息递交不过去，找平台确认是否递交联通网关有问题。"),
	R1_2034("R1:2034", "信息内容太长，改短一点。长短信内容长度超过运营商限制，运营建议一般不超过350"),
	R_00124("R:00124", "关机或内存满等原因消息下发失败"),
	R_00110("R:00110", "关机或内存满等原因消息下发失败"),
	R_06150("R:06150", "检查下彩信账号有没有余额"),
	MK_0015("MK:0015", "错误码意思是可能是手机满了"),
	DB_0138("DB:0138", "发送内容包含非法字符"),
	R1_0169("R1:0169", "超流速导致失败"),
	R1_0013("R1:0013", "号码非法，号码是否是13800138000之类的。"),
	R1_4801("R1:4801", "通道端口超过20位；或是通道原因，找平台确认万工是否有问题，是否提交失败。"),
	DB_0144("DB:0144", "运营全局黑名单，用户拨打10086解除。机主在黑名单中，应该机主之前投诉过，不再接受下行，故被加入黑名单。如果需要回复，一个是让平台查询回复，一个是让机主发送DZ到屏蔽通道解除。"),
	IC_0055("IC:0055", "天津网关流控，超流速导致失败。内容或含有关键字"),
	MC_0055("MC:0055", "内容或含有关键字"),
	R_04448("R:04448", "消息已经过期"),
	R_04414("R:04414", "MMSG系统拒绝"),
	R1_1112("R1:1112", "客户频繁提交超长内容的长短信，导致信息内容被运营商限制。客户不能自行扩展端口。长短信必须整条提交到运营商，客户不能拆分，否则会报这个错误。"),
	R1_0016("R1:0016", "不支持扩展子号"),
	MK_0010("MK:0010", "有可能是大批量提交到重庆移动，超流速失败。"),
	R_00089("R:00089", "北京联通网关故障，测试下不同地区号码看能否收到。超流量，超号码归属所在省份流量限制。"),
	R_00141("R:00141", "通道黑名单"),
	R_00068("R:00068", "湖南联通网关拦截"),
	UNKNOWN("UNKNOWN", "超流速或同一号码频繁批量发送被拦截。"),
	EXPIRED("EXPIRED", "暂时无法接通，或长时间关机不在服务区。"),
	R_00102("R:00102", "黑龙江联通号码，号码欠费；或用户手机接收短信功能不正常。"),
	R_00040("R:00040", "黑龙江联通号码，号码欠费；或用户手机接收短信功能不正常。"),
	ACCEPTD ("ACCEPTD ", "停机"),
	R_00023("R:00023", "无号码路由，怀疑湖南联通屏蔽或数据制作有问题。此通道在黑龙江没备案"),
	R1_1004("R1:1004", "通道断线，导致发送失败。"),
	E2_0099("E2:0099", "客户侧网络原因，让客户检查一下网络，telnet和ping一下服务器。"),
	M2_0045("M2:0045", "平台黑名单/属于黑名单要回复四个1到现用端口"),
	R1_1015("R1:1015", "不支持长短信，要拆分提交。"),
	MK_0057("MK:0057", "关机 "),
	R1_0403("R1:0403", "网关登录故障，通道停了。"),
	MI_0024("MI:0024", "关机 "),
	R1_0043("R1:0043", "第3方通道限速，我们这边底层重发还是失败。"),
	MAXXX("MAXXX", "超过信息内容变换最大值。即相同内容群发超过一定的数量400条，客户内容可变换的繁体字已用尽，无法再变换，导致剩下信息发送失败。(检查客户内容是否为70个字，如刚好是70个字则无法加空格变换，只能变换繁体，导致可变换的数值减少，把所有变换的条件都用完了返回MAXXX)"),
	F000134("F000134", "运营商网关网络故障导致发送失败"),
	S002010("S002010", "运营商网关网络故障导致发送失败"),
	R_00101("R:00101", "关机或空号，另F类了联通原因有关键字也会返回此代码，例如内容中有关键字“礼品”"),
	R1_1034("R1:1034", "登陆对方下级网关失败导致提交失败"),
	R_00145("R:00145", "北京联通黑名单，用户之前投诉过。另可查下是否也是我们平台的黑名单。"),
	F000008("F000008", "运营网关之间超流控失败 "),
	R1_0011("R1:0011", "网关可能没做中转"),
	R1_0006("R1:0006", "客户发的是170的号段，暂时不支持。"),
	R1_0254("R1:0254", "只能走二进制信息，走明文信息会报错这个错误。"),
	R1_0010("R1:0010", "客户侧扩展子号过长。"),
	R1_0128("R1:0128", "超流速"),
	M2_0013("M2:0013", "停机"),
	Word_ER ("Word ER", "内容有关键字。如把：“纪委”改成“纪.委” 就成功了");
	private SmsErrorCodeEnum(String code, String description) {
		this.code = code;
		this.description = description;
	}

	private String code;

	private String description;

	private static List<Map<String, Object>> list = new ArrayList<Map<String, Object>>();

	static {
		for (SmsErrorCodeEnum s : EnumSet.allOf(SmsErrorCodeEnum.class)) {
			Map<String, Object> lookup = new HashMap<String, Object>();
			lookup.put("code", s.getCode());
			lookup.put("description", s.getDescription());
			list.add(lookup);
		}
	}

	public static List<Map<String, Object>> getMapList() {
		return list;
	}

	public String getCode() {
		return code;
	}

	public void setCode(String code) {
		this.code = code;
	}

	public String getDescription() {
		return description;
	}

	public void setDescription(String description) {
		this.description = description;
	}
}
